# Tap into repositories
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"

# Set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

# Terminal and shell environment
brew "eza"
brew "fzf"
brew "neovim"
brew "ripgrep"
brew "stow"
brew "tldr"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "zoxide"
brew "zsh"

# Git
brew "git"
brew "git-lfs"
brew "lazygit"

# Utils and tools
brew "bat"
brew "coreutils"
brew "magic-wormhole"
brew "nmap"

# Containerization
brew "docker"
brew "docker-completion"

# Go lang environment
brew "go"

# NodeJS environment
brew "nvm"
brew "yarn"

# Python environment
brew "poetry"
brew "pyenv"

# Ruby environment
brew "rbenv"
brew "ruby-build"

# iOS development tools
brew "mockolo"
brew "needle"
brew "swiftformat"
brew "swiftlint"
brew "xcbeautify"
brew "xcodegen"

# Tiling window management
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

# Casks
cask "alacritty"
cask "alfred"
cask "appcleaner"
cask "firefox"
cask "fork"
cask "google-chrome"
cask "insomnia"
cask "kitty"
cask "meetingbar"
cask "obsidian"
cask "proxyman"
